# Agenda, day 2

1. Q&A
2. Data frames -- creating and working with them
3. Adding and removing data in our data frames
4. Useful methods for data frames
5. Boolean / mask indexes and selecting data
6. using `.loc` for retrieving rows, rows/columns
7. Reading data from outside sources
    - CSV, Excel, etc.
  
Download this file, which contains a few items we'll use in the class: https://files.lerner.co.il/data-science-exercise-files.zip

In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [3]:
temps = Series([20, 23, 25, 22, 23], index=list('abcde'))
temps

a    20
b    23
c    25
d    22
e    23
dtype: int64

# Most of the time, we want 2D data!

It's pretty standard to have *tabular* data, which contains 2 dimensions, normally seen as rows and columns.

You want think of each column in a data frame (which is the Pandas 2D data structure) as a series. It will have an index for each element.  Those indexes are shared across all of the columns, and each column has its own name, as well.

In a data frame:

- The rows are labeled with an index
- The columns are labeled with columns (yeah, that's repetitive)

In [4]:
# To create a data frame:
# - we need 2D data -- this could be a list of lists, or a list of dicts, or a dict of lists
#   it could also be a 2D NumPy array
# - we need names for the rows (the index)
# - we need names for the columns

# something simple, using a list of lists

df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]])
df

     0    1    2
0   10   20   30
1   40   50   60
2   70   80   90
3  100  110  120

In [5]:
# let's add names for both our index (the rows) and our columns


df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]],
              index=list('abcd'),
              columns=list('xyz'))
df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [6]:
# if I want to retrieve a row, I can use .loc or .iloc, just like with
# a series!

df.loc['a']   # this retrieves row a

x    10
y    20
z    30
Name: a, dtype: int64

Pandas only knows how to handle data in a limited number of ways. If you ask for one value, you'll get that value. But if you ask for a number of values in 1D, you'll get a series. (That's what we got here.) If you ask for a number of values in 2D, you'll get a data frame.

In [7]:
df.loc['b']

x    40
y    50
z    60
Name: b, dtype: int64

In [8]:
df.loc['d']

x    100
y    110
z    120
Name: d, dtype: int64

In [10]:
%xmode Minimal
df.loc['x']

Exception reporting mode: Minimal

KeyError: 'x'

In [11]:
# how can I retrieve a single column?
# for this, we use just []! 
# this is why I asked you last week *NOT* to use just [] to get items from a series,
# but rather to use .loc and .iloc

df['x']  # this is a column, and we get it back!

a     10
b     40
c     70
d    100
Name: x, dtype: int64

In [12]:
# can I retrieve more than one row, or more than one column?
# remember, we can use "fancy indexing," passing a list of index/column names

df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [13]:
df.loc[['a', 'c']]  # fancy indexing

    x   y   z
a  10  20  30
c  70  80  90

In [15]:
df.loc['b':'d']   # slice -- only one pair of [] -- with .loc, the endpoint is included!

     x    y    z
b   40   50   60
c   70   80   90
d  100  110  120

In [16]:
# you can do similar things with .iloc, which uses the numeric position

df.iloc[1]

x    40
y    50
z    60
Name: b, dtype: int64

In [17]:
df.iloc[[1, 3]]

     x    y    z
b   40   50   60
d  100  110  120

In [19]:
df.iloc[1:3]  # this is up to and *not* including, as usual in Python

    x   y   z
b  40  50  60
c  70  80  90

In [20]:
# how can I retrieve multiple columns?
# answer: just use a list of column names, as you would with the index

df[['x', 'z']]

     x    z
a   10   30
b   40   60
c   70   90
d  100  120

In [21]:
df[['z', 'x']]   # retrieve them in a different order

     z    x
a   30   10
b   60   40
c   90   70
d  120  100

In [22]:
# sometimes, you might want a one-column data frame, rather than a series
# you could say

df['x']

a     10
b     40
c     70
d    100
Name: x, dtype: int64

In [23]:
# instead, you can say

df[['x']]   # the [[ ]] means: I want a data frame back, even though, just one column

     x
a   10
b   40
c   70
d  100

In [24]:
# once you have retrieved from a data frame, you can perform all sorts of calculations
# using methods -- min, mean, max, std, median, etc.

# Exercise: Grocery store

1. Create a data frame in which you have two columns. One is the price of an item (`price`), and the other will be the number of sales of that item (`sales`). The index will be the names of the items that you are selling.
2. The data frame should have 4 rows, and each item will have a price and a number of sales.
3. Retrieve all of the info for apples.
4. Retrieve all of the info for bananas.
5. Retrieve all information for apples and bananas.
6. What is the mean price for all products?
7. What is the mean price for just apples and bananas?

In [26]:
df = DataFrame([[10, 5],
                [15, 4],
                [7, 10],
                [20, 2]],
            index='apple banana cucumber dill'.split(),
             columns='price sales'.split())

df

          price  sales
apple        10      5
banana       15      4
cucumber      7     10
dill         20      2

In [27]:
# Retrieve all of the info for apples.

df.loc['apple']

price    10
sales     5
Name: apple, dtype: int64

In [28]:
# Retrieve all of the info for bananas.

df.loc['banana']

price    15
sales     4
Name: banana, dtype: int64

In [29]:
# Retrieve all information for apples and bananas.

df.loc[  ['apple', 'banana']   ]

        price  sales
apple      10      5
banana     15      4

In [30]:
# What is the mean price for all products?

df['price'].mean()

np.float64(13.0)

In [31]:
# What is the mean price for just apples and bananas?

df.loc[ ['apple', 'banana']]

        price  sales
apple      10      5
banana     15      4

In [33]:
df.loc[ ['apple', 'banana']] ['price'].mean()

np.float64(12.5)

In [35]:
# a better way, if we have both the rows we want and the column(s) we want,
# is to use the 2-argument version of df.loc:

(
df.loc[ 
    ['apple', 'banana'],  # row selector
    ['price']]            # column selector
    .mean()
)

price    12.5
dtype: float64

# Modifying our data frame

1. We can add a new column by assigning to it. (If the column name already exists, then we replace the old one.) Just make sure that the value we assign to it has the same number of elements as the data frame's index!
2. We can add a new row by assigning to `.loc`. Here, if the index already exists, we get a new row anyway, with the same (repeated) index.

In [37]:
supermarket_df = df
supermarket_df

          price  sales
apple        10      5
banana       15      4
cucumber      7     10
dill         20      2

In [38]:
df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]],
              index=list('abcd'),
              columns=list('xyz'))
df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [39]:
df['new_column'] = [2,4,6,8]

In [40]:
df

     x    y    z  new_column
a   10   20   30           2
b   40   50   60           4
c   70   80   90           6
d  100  110  120           8

In [41]:
df['new_column'] = [1,2,3,4]

In [42]:
df

     x    y    z  new_column
a   10   20   30           1
b   40   50   60           2
c   70   80   90           3
d  100  110  120           4

In [43]:
df['w'] = [1,2,3]

ValueError: Length of values (3) does not match length of index (4)

In [44]:
# we can calculate based on existing series,
# and then assign the result to a new series!

df['x'] + df['y']

a     30
b     90
c    150
d    210
dtype: int64

In [45]:
df['x_and_y'] = df['x'] + df['y']

In [46]:
df

     x    y    z  new_column  x_and_y
a   10   20   30           1       30
b   40   50   60           2       90
c   70   80   90           3      150
d  100  110  120           4      210

In [47]:
# what happens if I want to add a new row?

df.loc['e'] = [200, 300, 400, 500, 600]

df

     x    y    z  new_column  x_and_y
a   10   20   30           1       30
b   40   50   60           2       90
c   70   80   90           3      150
d  100  110  120           4      210
e  200  300  400         500      600

# Exercise: More groceries!

1. Define a new column, `revenue`, for the groceries, which will be `price` * `sales`. What is the mean of the `revenue` column?
2. Define a new column, `sales_tax`, in which you calculate 10% of the revenue.
3. Define a new column, `net`, which is `revenue` - `sales_tax`

In [48]:
supermarket_df

          price  sales
apple        10      5
banana       15      4
cucumber      7     10
dill         20      2

In [49]:
supermarket_df['price'] * supermarket_df['sales']

apple       50
banana      60
cucumber    70
dill        40
dtype: int64

In [51]:
supermarket_df['revenue'] = supermarket_df['price'] * supermarket_df['sales']
supermarket_df

          price  sales  revenue
apple        10      5       50
banana       15      4       60
cucumber      7     10       70
dill         20      2       40

In [52]:
supermarket_df['sales_tax'] = supermarket_df['revenue'] * 0.1
supermarket_df

          price  sales  revenue  sales_tax
apple        10      5       50        5.0
banana       15      4       60        6.0
cucumber      7     10       70        7.0
dill         20      2       40        4.0

In [53]:
supermarket_df['revenue'] - supermarket_df['sales_tax']

apple       45.0
banana      54.0
cucumber    63.0
dill        36.0
dtype: float64

In [55]:
supermarket_df['net'] = supermarket_df['revenue'] * 0.9
supermarket_df

          price  sales  revenue  sales_tax   net
apple        10      5       50        5.0  45.0
banana       15      4       60        6.0  54.0
cucumber      7     10       70        7.0  63.0
dill         20      2       40        4.0  36.0

# Alternative syntax for columns: dot syntax

Instead of saying `df[colname]` to get a column, you can say `df.colname`, with a `.`!

The good news:
- Shorter

The bad news:
- You might get confused about column names vs. methods vs. other attributes on a data frame
- If you have a column with the same name as a Pandas method, bad news!
- If you have a column with spaces or other special characters, that's not allowed with dot syntax
- It makes (I believe) for more confusing code, because it's less obvious which are the methods and which are the columns

In [57]:
supermarket_df.revenue

apple       50
banana      60
cucumber    70
dill        40
Name: revenue, dtype: int64

# Next up

1. Useful methods (data frame versions of many you know, and some new ones)
2. Boolean/mask indexes and our data frames

# Rule of thumb #1

Anywhere you can pass a single string (for an index, or a column name), you can pass a list of strings (for more than one index, or more than one column name).

# Rule of thumb #2

Anything you can do to a series, you can do to a data frame:

- If the series version of a method returns a single (scalar) value, then the data frame version of the same method will return a series.
- If the series version of a method returns a series, then the data frame version of the same method will return a data frame.

In [58]:
s = Series([10, 20, 30, 40, 50, 60, 70, 80],
          index=list('abcdefgh'))

# I'll use a dict of lists; each key is a column name, and each value
# is a list, the values for that column

df = DataFrame({'numbers': [10, 20, 30, 40, 50, 60, 70,  80],
               'times_10': [100, 200, 300, 400, 500, 600, 700, 800]},
              index=list('abcdefgh'))

s

a    10
b    20
c    30
d    40
e    50
f    60
g    70
h    80
dtype: int64

In [59]:
df

   numbers  times_10
a       10       100
b       20       200
c       30       300
d       40       400
e       50       500
f       60       600
g       70       700
h       80       800

In [60]:
# what's the mean of s?

s.mean()   # this returns a single (scalar) value

np.float64(45.0)

In [62]:
# what's the mean of df?
# by our rule #2, we'll get a result for each column
# if you run a method on a data frame, you get one result per column

df.mean()  # this will return a series

numbers      45.0
times_10    450.0
dtype: float64

In [63]:
s.min()

np.int64(10)

In [64]:
s.max()

np.int64(80)

In [65]:
df.min()

numbers      10
times_10    100
dtype: int64

In [66]:
df.max()

numbers      80
times_10    800
dtype: int64

In [67]:
# I can, instead, just run s.describe() to get all of the 
# descriptive statistics for my series

s.describe()   # describe returns a series for our series

count     8.000000
mean     45.000000
std      24.494897
min      10.000000
25%      27.500000
50%      45.000000
75%      62.500000
max      80.000000
dtype: float64

In [68]:
df.describe()  # describe will give us a series of descriptions for each column

         numbers    times_10
count   8.000000    8.000000
mean   45.000000  450.000000
std    24.494897  244.948974
min    10.000000  100.000000
25%    27.500000  275.000000
50%    45.000000  450.000000
75%    62.500000  625.000000
max    80.000000  800.000000

In [69]:
# get the first 5 values from our series

s.head()

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [70]:
s.head(5)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [71]:
s.tail()

d    40
e    50
f    60
g    70
h    80
dtype: int64

In [72]:
s.tail(5)

d    40
e    50
f    60
g    70
h    80
dtype: int64

In [73]:
# head/tail give us a series from a series
# head/tail will give us a data frame from a data frame

df.head()

   numbers  times_10
a       10       100
b       20       200
c       30       300
d       40       400
e       50       500

In [74]:
df.tail()

   numbers  times_10
d       40       400
e       50       500
f       60       600
g       70       700
h       80       800

In [75]:
import numpy as np

s = Series([10, 20, np.nan, 40, 50, np.nan, 70, 80],
          index=list('abcdefgh'))

# I'll use a dict of lists; each key is a column name, and each value
# is a list, the values for that column

df = DataFrame({'numbers': [10, 20, np.nan, 40, 50, np.nan, 70,  80],
               'times_10': [100, 200, 300, np.nan, 500, 600, 700, np.nan]},
              index=list('abcdefgh'))

s

a    10.0
b    20.0
c     NaN
d    40.0
e    50.0
f     NaN
g    70.0
h    80.0
dtype: float64

In [77]:
df

   numbers  times_10
a     10.0     100.0
b     20.0     200.0
c      NaN     300.0
d     40.0       NaN
e     50.0     500.0
f      NaN     600.0
g     70.0     700.0
h     80.0       NaN

In [ ]:
# how can I deal with NaN?
# option 1: delete it!

s.dropna()  # th